Repository: elvvelon/Snyty
Catalog: Snyty/Localizable.xcstrings
Source language: uk
Languages: en

source: - циклів
en: - cycles

source: -- хв
en: -- min

# %@ hours_key сну
source: %@ год сну
en: %@ hours of sleep

# %lld cycles_key
source: %lld цикли
en: %lld cycles

source: %lld год
en: %lld hours

source: %lld хв
en: %lld mins

source: %lld хвилин
en: %lld minutes

source: %lld циклів
en: %lld cycles

source: < %lld циклів
en: < %lld cycles

source: > %lld циклів
en: > %lld cycles

source: ~ %lld циклів
en: ~ %lld cycles

source: 0 циклів
en: 0 cycles

source: 20 хв
en: 20 mins

source: 20 хвилин
en: 20 minutes

source: 90 хв
en: 90 mins

source: 90 хвилин
en: 90 minutes

# Ascent
source: Сходження
en: Ascent

# Cadence
source: Такт
en: Cadence

# Clarity
source: Ясність
en: Clarity

# Enchant
source: Чари
en: Enchant

# Expanse
source: Розширення
en: Expanse

# Genesis
source: Творення
en: Genesis

# hours_key
source: годин
en: hours

# Idle
source: Безтурботність
en: Idle

# Launch
source: Запуск
en: Launch

# Linger
source: Байдикування
en: Linger

# mins_key
source: хвилин
en: minutes

# Mirage
source: Марево
en: Mirage

# Pendulum
source: Маятник
en: Pendulum

# Resolve
source: Намір
en: Resolve

# Standard
source: Стандартний
en: Default

# Tidings
source: Звістка
en: Tidings

# Vigor
source: Жвавість
en: Vigor

source: Аналіз сну
en: Sleep analysis

source: Бадьорих снів
en: Sleep well

source: Будильник
en: Alarm

source: Будильники
en: Alarms

source: Будьте обережними зі зміною цього значення! Зазвичай повний цикл сну триває близько 90 хвилин. Цього часу достатньо, щоб організм послідовно пройшов усі стадії: від легкого сну до глибокого відновлення тканин та фази сновидінь (REM), яка відповідає за обробку інформації. Корегуйте цей параметр лише за умови, що ви точно знаєте тривалість своїх циклів (наприклад, на основі даних трекерів), оскільки помилка в розрахунках навіть у 5–10 хвилин може призвести до пробудження посеред глибокої фази, що спричинить відчуття сильної втоми протягом дня.
en: Be careful changing this value!\nUsually, a full sleep cycle lasts about 90 minutes. This time is enough for the body to sequentially pass through all stages: from light sleep to deep tissue recovery and the REM phase, which is responsible for processing information.\nAdjust this parameter only if you know the exact duration of your cycles (for example, based on tracker data), since a calculation error of even 5–10 minutes can lead to waking up in the middle of a deep phase, which will cause a feeling of severe fatigue throughout the day.

source: Ваш провідник у світ глибоких снів та бадорих ранків
en: Your guide to the world of deep sleep and refreshed mornings

source: Ваш хронотип
en: Your chronotype

source: Ваші будильники з’являться тут, щойно ви оберете ідеальний час для сну.
en: Your alarms will appear here once you choose the perfect bedtime.

source: Вдих на 4 рахунки, затримка на 7, видих на 8. Ця вправа миттєво заспокоює серцебиття.
en: Inhale for 4 counts, hold for 7, exhale for 8. This exercise instantly calms your heartbeat.

source: Видалити
en: Delete

source: Відкласти
en: Snooze

source: Відмінити
en: Cancel

source: Вікно сну
en: Sleep window

source: Вітаємо!
en: Welcome!

source: Вкажіть час вашого пробудження, щоб ми налаштували графік циркадних ритмів саме під вас. Це допоможе програмі підказувати ідеальні моменти для активності та відпочинку, спираючись на ваш персональний біологічний годинник.
en: Specify your wake-up time so we can adjust the circadian rhythm schedule just for you. This will help the app suggest the ideal moments for activity and rest based on your personal biological clock.

source: Все готово!
en: All set!

source: Головний секрет бадьорості — прокинутися в правильний момент. Snyty розраховує ідеальний графік відпочинку саме для вас. Він підкаже, о котрій лягти спати або завести будильник, щоб оминути глибокий сон і легко розпочати новий день.
en: The main secret of feeling refreshed is waking up at the right moment. Snyty calculates the ideal rest schedule just for you. It will tell you when to go to bed or set an alarm to avoid deep sleep and start your day easily.

source: Голуб
en: Dove

source: Гормональний баланс
en: Hormonal balance

source: Далі
en: Next

source: Дихання 4-7-8
en: 4-7-8 Breathing

source: Для денного сну використовуйте маску. Навіть через закриті повіки мозок реагує на світло, що заважає якісному відпочинку.
en: Use a sleep mask for daytime naps. Even through closed eyelids, the brain reacts to light, which prevents quality rest.

source: Добрий вечір!
en: Good evening!

source: Добрий день!
en: Good afternoon!

source: Доброго ранку!
en: Good morning!

source: Доброї ночі!
en: Good night!

source: Дозволити відкладання
en: Allow snooze

source: Дозвольте нам допомогти
en: Let us help

source: Доступ до будильників вимкнено
en: Access to alarms is disabled

source: Ефект бадьорості
en: Energizing effect

source: Жайворонок
en: Lark

source: Зазвичай 15 хв
en: Typically 15 min

source: Зазвичай 90 хв
en: Typically 90 min

source: Зазвичай людям потрібно 15 хвилин на те, щою заснути, проте, якщо у вас це зазвичай займає інший час – ви можете визначити його та ми врахуємо нове значення під час наступних розрахунків.
en: Usually, people need 15 minutes to fall asleep, however, if it typically takes you a different amount of time, you can specify it and we will take the new value into account during future calculations.

source: Засинати о
en: Fall asleep at

source: Звук
en: Sound

source: Звук будильника
en: Alarm sound

source: Зміна цих налаштувань також вплине на всі вже заведені будильники.
en: Changing these settings will also affect all currently set alarms.

source: Змінити
en: Edit

source: ЗРОБЛЕНО ДЛЯ ВАШОГО СНУ
en: MADE FOR YOUR SLEEP

source: Ідеальний сон
en: Perfect sleep

source: Інший
en: Other

source: Існує ідеальний проміжок між 22:00 та 23:00, коли рівень кортизолу падає, а мелатонін зростає. Спробуйте встигнути в цей «потік».
en: There is an ideal window between 22:00 and 23:00 when cortisol levels drop and melatonin rises. Try to catch this "flow".

source: Користь білого шуму
en: Benefits of white noise

source: Короткий сон перезавантажує мозок. Головне — встати до початку фази глибокого сну.
en: A short nap reboots the brain. The key is to wake up before the deep sleep phase begins.

source: Кофеїновий сон
en: Coffee nap

source: Легке відновлення
en: Light recovery

source: Магія темряви
en: Magic of darkness

source: Менша кількість світла сприяє виробленню мелатоніну. Вимкніть яскраві лампи за годину до сну.
en: Less light promotes melatonin production. Turn off bright lights an hour before bed.

source: менше хвилини
en: less than a minute

source: Метод «Вивантаження»
en: The "Brain Dump" method

# Ми врахували %@ на засинання. Ваш будильник пролунає о %@
source: Ми врахували %1$@ на засинання. Ваш будильник пролунає о %2$@
en: We factored in %1$@ to fall asleep. Your alarm will sound at %2$@

source: Ми врахували %@ на засинання. Цей параметр можна змінити в налаштуваннях.
en: We factored in %@ to fall asleep. This can be changed in Settings.

source: Монотонні звуки дощу або вентилятора маскують різкі нічні шуми, допомагаючи мозку залишатися в стані спокою.
en: Monotonous sounds of rain or a fan mask sharp nighttime noises, helping the brain stay at rest.

source: На добраніч!
en: Good night!

source: На скільки відкладати
en: Snooze duration

source: На сон приблизно:
en: Sleep time approx:

source: Нагадування про сон
en: Sleep reminder

source: Надати
en: Grant

source: Назад
en: Back

source: Назва
en: Name

source: Найкращий варіант
en: Best option

source: Налаштування
en: Settings

source: Налаштуйте автоматичне увімкнення режиму «Сон» на iPhone. Навіть світло від екрана сповіщення може частково вас розбудити.
en: Set up your iPhone to automatically turn on Sleep focus. Even the light from a notification screen can partially wake you up.

source: Наступний будильник
en: Next alarm

source: О котрій ви зазвичай прокидаєтеся?
en: What time do you usually wake up?

source: Обережно з цукром
en: Careful with sugar

source: Огляд
en: Dashboard

source: Однакова послідовність дій щовечора (наприклад, душ — книга — ліжко) створює в мозку стійкий рефлекс засинання.
en: The same sequence of actions every evening (e.g., shower — book — bed) creates a strong sleep reflex in the brain.

source: Оптимальний час для глибокого відновлення та сну
en: Optimal time for deep recovery and sleep

source: Організм прокидається, рівень кортизолу зростає
en: The body wakes up, cortisol level rises

source: Перейти в налаштування
en: Go to Settings

source: Підтримуйте природний ритм
en: Maintain a natural rhythm

source: Пік продуктивності та фокусу, найкращий час для складних завдань
en: Peak productivity and focus, the best time for complex tasks

source: Повне відновлення
en: Full recovery

source: Повний цикл
en: Full cycle

source: Правило 20 хвилин
en: The 20-minute rule

source: Природний спад енергії, добре підходить для рутинної роботи
en: Natural energy dip, well-suited for routine work

source: пробуйте по черзі напружувати та розслабляти пальці ніг, ікри, стегна. Це техніка прогресивної релаксації, що прискорює сон.
en: Try alternately tensing and relaxing your toes, calves, and thighs. This is a progressive relaxation technique that speeds up falling asleep.

source: Прокинутися о
en: Wake up at

source: Режим «Не турбувати»
en: Do Not Disturb mode

source: Ритуали сну
en: Sleep rituals

source: Розпочати
en: Get started

source: Розрахувати
en: Calculate

source: Розрахунки сну
en: Sleep calculations

source: Розслаблення м'язів
en: Muscle relaxation

source: Саме під час REM-фази мозок обробляє емоції та інформацію. Короткий сон (Power Nap) якраз допомагає «перезавантажитися».
en: It is during the REM phase that the brain processes emotions and information. A short nap (Power Nap) helps you "reboot".

source: Синє світло екрана обманює мозок. Спробуйте відкласти гаджет за 30 хвилин до сну.
en: The blue light from screens tricks the brain. Try to put your device away 30 minutes before sleep.

source: Скоро...
en: Coming soon...

source: Сова
en: Owl

source: Солодке на ніч дає різкий прилив енергії, що змушує мозок працювати активніше замість того, щоб готуватися до спокою.
en: Sweets at night give a sharp surge of energy, forcing the brain to work more actively instead of preparing for rest.

source: Солодких снів і найбадьоріших ранків. Snyty потурбується про ваш відпочинок
en: Sweet dreams and the most refreshed mornings. Snyty will take care of your rest.

source: Сон
en: Sleep

source: Сповіщення
en: Notifications

source: Темні окуляри
en: Dark glasses

source: Тривалість циклу
en: Cycle duration

source: Тут поки що тихо...
en: It's quiet here for now...

source: Фаза швидкого сну
en: REM sleep phase

source: хвилин
en: minutes

source: хвилини
en: minutes

source: Хронотип
en: Chronotype

source: Цифровий детокс
en: Digital detox

source: Ці параметри будуть враховані під час наступних розрахунків.
en: These parameters will be taken into account during future calculations.

source: Цього разу мені потрібно на засинаня:
en: Time needed to fall asleep this time:

source: Час бадьорості!
en: Wake up time!

source: Час лягати спати
en: Bedtime

source: Час на засинання
en: Time to fall asleep

source: Час сповільнюватися, організм готується до сну
en: Time to slow down, the body is preparing for sleep

source: Швидкий сон
en: Power nap

source: Щоб будити вас вчасно
en: To wake you up on time

source: Щоб ми могли вчасно вас розбудити, дозвольте застосунку керувати будильниками в Налаштуваннях.
en: So we can wake you up on time, please allow the app to manage alarms in Settings.

source: Щоб прокинутись бадьорим, краще лягти спати о:
en: To wake up refreshed, it's best to go to bed at:

source: Щоб розбудити вас у найкращий для цього час чи нагадати, що вже час йти спати, нам потрібні наступні дозволи:
en: To wake you up at the best time or remind you it's bedtime, we need the following permissions:

source: Я лягаю спати зараз
en: I'm going to sleep now

source: Я хочу прокинутися о
en: I want to wake up at

source: Якщо ви ляжете зараз, краще прокинутися о:
en: If you go to bed now, it's best to wake up at:

source: Якщо ви пʼєте каву, то зробіть це безпосередньо перед 20-хвилинним сном. Кофеїн подіє якраз тоді, коли ви прокинетеся, давши подвійний заряд енергії.
en: If you drink coffee, do it right before a 20-minute nap. The caffeine will kick in just as you wake up, giving you a double energy boost.

source: Якщо ви спите вдень, робіть це до 15:00, щоб не зіпсувати свій основний нічний графік.
en: If you nap during the day, do it before 3:00 PM so you don't ruin your main nighttime sleep schedule.

source: Якщо не можете відкласти телефон, увімкніть «теплий» режим екрана. Це менше пригнічує вироблення мелатоніну.
en: If you can't put your phone away, turn on the "warm" screen mode. This suppresses melatonin production less.

source: Якщо тривожні думки не дають заснути, випишіть список справ на завтра на папір. Це дозволить мозку «відпустити» контроль.
en: If anxious thoughts keep you awake, write a to-do list for tomorrow on paper. This will allow your brain to "let go" of control.
